# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# CLI Tools
brew "git"
cask "hammerspoon"
brew "fzf"
brew "fd"
brew "bat"
brew "lazygit"
brew "tree"
brew "coreutils"  # for gtimeout
brew "ripgrep"

# Languages & Runtimes
brew "go"
brew "uv"

# Applications
cask "visual-studio-code"
cask "google-chrome"
cask "iterm2"
cask "maccy"
cask "obsidian"

# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
