aaron-bond.better-comments
albert.tabout
anthropic.claude-code
astral-sh.ty
azemoh.one-monokai
charliermarsh.ruff
enkia.tokyo-night
esbenp.prettier-vscode
golang.go
mechatroner.rainbow-csv
metaseed.metago
metaseed.metajump
metaseed.metaword
mhutchie.git-graph
mikestead.dotenv
mrmlnc.vscode-duplicate
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
pkief.material-icon-theme
shd101wyy.markdown-preview-enhanced
tomoki1207.pdf
yzane.markdown-pdf
